# 3. Задайте список из n чисел, заполненный по формуле (1 + 1/n) ** n и выведите на экран их сумму.
# Для n = 6: [2, 2, 2, 2, 2, 3] -> 13

n = int(input('Введите число: '))
num = []
for i in range(1,n+1):
    num.append(round((1+1/i)**i))
print(num, end=' ')